# import pymssql
#
# # server    数据库服务器名称或IP
# # user      用户名
# # password  密码
# # database  数据库名称
# conn = pymssql.connect(host='rm-2ze00tnh50cxx6387o.sqlserver.rds.aliyuncs.com', user='r_xxbmm', password='xxbmm@read2017', database='sharebuy_test',charset="utf8", port=3433)

# cursor = conn.cursor()

# from unittest import mock


# (商品总额 - 满减金额) * 税率 + (商品总额 - 满减金额) - 优惠券金额
a = (5.55 - 5.55 / 105.55 * 3.77) * 0.17 + (5.55 - 5.55 / 212.63 * 41.1)
print(a)

b = (100 - 100 / 105.55 * 3.77) * 0.5733 + (100 - 100 / 212.63 * 41.1)
print(b)

c = (107.08 - 37.33) * 0.11 + (107.08 - 107.08 / 212.63 * 41.1)
print(c)

print(a + b + c - 10)
print((5.55 - 5.55 / 105.55 * 3.77) * 0.17 + (100 - 100 / 105.55 * 3.77) * 0.5733 + (107.08 - 37.33) * 0.11)

# 税额
# c = (100 - (round(100 / 343.22, 4)) * 171.61) * 0.999 + (111.11 - round((111.11 / 343.22), 4) * 171.61) * 0.13
# print(c)
# print(round((111.11 / 343.22 * 171.61), 4))
# # (round(100 / 343.22, 4))
# d = (100 - 100 / 343.22 * 171.61) * 0.999
# print(d)
# e = (111.11 - 111.11 / 343.22 * 171.61) * 0.13
# print(e)
# print(111.11 / 343.22 * 171.61)
# from decimal import Decimal
# p = 1 + 5.55 + 133.85
# print(p)
#
# a = (1 - 1 / 140.4 * 70.2) * 0.77777 + (1 - 1 / 140.4 * 70.2)
# print(a)
# a = (5.55 - 5.55 / 140.4 * 70.2) * 0.17 + (5.55 - 5.55 / 140.4 * 70.2)
# print(a)
# a = (133.85 - 133.85 / 140.4 * 70.2) * 0.11 + (133.85 - 133.85 / 140.4 * 70.2)
# print(a)
#
# sl = (1 - 1 / 140.4 * 70.2) * 0.77777 + (5.55 - 5.55 / 140.4 * 70.2) * 0.17 + (133.85 - 133.85 / 140.4 * 70.2) * 0.11 \
#      + 1711.7 * 0.091 + 100 * 0.119
# print("税率是： {}".format(sl))
#
# ze = 1 + 5.55 + 100 + 1711.7 + 133.85 - 70.2 - 10 + sl
#
# print(ze)
